In [1]:
import pandas as pd
import numpy as np

In [2]:
df_com_original = pd.read_csv("https://github.com/SubhanAhsan/ds_ibm_capstone/raw/master/data/dubai_com_geo.csv")

In [3]:
df_com_original.head()

,X,Y,gid,Name,description,CNAME_E,OBJECTID,LABEL_E,C_PREFIX_E,C_PREFIX_A,COMMUNITY_,DGIS_ID,COMM_NUM,NDGIS_ID,SHAPE_AREA,SHAPE_LEN
0,55.238901,24.696762,2,kml_2,NaN,HEFAIR,24,HEFAIR,Community:,NaN,HEFAIR - 991,227,991,227,1.435665e+08,51721.211180
1,55.351739,25.075185,6,kml_6,NaN,WADI AL SAFA 5,28,WADI AL SAFA 5,Community:,NaN,WADI AL SAFA 5 - 648,228,648,228,1.631967e+07,22350.662760
2,55.381360,24.870378,16,kml_16,NaN,SAIH AL SALAM,38,SAIH AL SALAM,Community:,NaN,SAIH AL SALAM - 951,217,951,217,8.869042e+07,42842.713290
3,55.543516,25.239984,127,kml_127,NaN,AL TTAY,149,AL TTAY,Community:,NaN,AL TTAY - 284,55,284,55,3.294484e+06,12793.454780
4,55.336311,25.268667,21,kml_21,NaN,AL KHABAISI,43,AL KHABAISI,Community:,NaN,AL KHABAISI - 128,30,128,30,1.226749e+06,5559.091719

In [4]:
df_com = df_com_original[["X", "Y", "gid", "CNAME_E", "COMMUNITY_", "COMM_NUM"]]

In [5]:
df_com.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 226 entries, 0 to 225
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   X           226 non-null    float64
 1   Y           226 non-null    float64
 2   gid         226 non-null    int64
 3   CNAME_E     226 non-null    object
 4   COMMUNITY_  226 non-null    object
 5   COMM_NUM    226 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 10.7+ KB

In [6]:
df_com

,X,Y,gid,CNAME_E,COMMUNITY_,COMM_NUM
0,55.238901,24.696762,2,HEFAIR,HEFAIR - 991,991
1,55.351739,25.075185,6,WADI AL SAFA 5,WADI AL SAFA 5 - 648,648
2,55.381360,24.870378,16,SAIH AL SALAM,SAIH AL SALAM - 951,951
3,55.543516,25.239984,127,AL TTAY,AL TTAY - 284,284
4,55.336311,25.268667,21,AL KHABAISI,AL KHABAISI - 128,128
...,...,...,...,...,...,...
221,55.177209,25.060145,222,AL THANYAH FOURTH,AL THANYAH FOURTH - 394,394
222,55.375148,25.153181,223,NADD AL SHIBA THIRD,NADD AL SHIBA THIRD - 616,616
223,55.304043,25.274348,224,AYAL NASIR,AYAL NASIR - 116,116
224,55.311262,25.237983,225,OUD METHA,OUD METHA - 319,319
225,55.134069,25.040448,226,JABAL ALI FIRST,JABAL ALI FIRST - 591,591

In [7]:
df_com.shape

(226, 6)

In [9]:
len(df_com["COMM_NUM"].unique())

226

In [13]:
df_com.isna().describe()

            X      Y    gid CNAME_E COMMUNITY_ COMM_NUM
count     226    226    226     226        226      226
unique      1      1      1       1          1        1
top     False  False  False   False      False    False
freq      226    226    226     226        226      226

In [28]:
df_com["COMM_NUM"].apply(str).apply(len).describe()

count    226.0
mean       3.0
std        0.0
min        3.0
25%        3.0
50%        3.0
75%        3.0
max        3.0
Name: COMM_NUM, dtype: float64